biddr_api/app/controllers/api/v1/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        auctions = Auction.order(created_at: :desc)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        auction = Auction.find(params[:id])

INSERT INTO "auctions" ("user_id", "title", "description", "reserve_price", "closing_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        auction = Auction.new(auction_params)
        auction.user = current_user

        if auction.save