biddr_api/app/controllers/api/v1/bids_controller.rb

    def create
        auction = Auction.find(params[:auction_id])

        bid = Bid.new(bid_params)
        bid.auction = auction
        bid.user = current_user

        if bid.save
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bids" ("user_id", "auction_id", "bid_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["auction_id", 1], ["bid_price", 10], ["created_at", "2022-12-08 00:54:31.388535"], ["updated_at", "2022-12-08 00:54:31.388535"]]