biddr_api/app/controllers/api/v1/users_controller.rb

    def create
        user_params = params.require(:user).permit(
            :name, :email, :password, :password_confirmation
            )
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["email", "email@email.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-07 23:52:52.648860"], ["updated_at", "2022-12-07 23:52:52.648860"]]